{
  "todos": {
    "Coordinator": {
      "1": {
        "id": "1",
        "content": "Complete comprehensive testing of the entire KCT Menswear system",
        "details": "1. Test order creation flow (both Stripe and catalog products). 2. Test shipping rate calculation and label generation. 3. Test email automation workflows. 4. Test EasyPost webhook integration. 5. Test all API endpoints. 6. Test authentication and security. 7. Test error handling scenarios. 8. Validate all integrations work end-to-end. 9. Provide detailed test results report.",
        "status": "pending",
        "priority": "high"
      },
      "2": {
        "id": "2",
        "content": "Create focused API keys and connection document",
        "details": "1. Extract essential keys, URLs, and connection details from existing documentation. 2. Create a concise, developer-friendly reference document. 3. Include only the critical information needed for frontend integration. 4. Organize by priority (must-have vs nice-to-have). 5. Include quick setup checklist.",
        "status": "pending",
        "priority": "medium"
      },
      "3": {
        "id": "3",
        "content": "Build comprehensive Wedding Party Management System (V1 Complete)",
        "details": "1. Create Wedding Admin Dashboard (3rd admin interface) for staff management. 2. Build customer-facing Wedding Portal for couples to manage their wedding party. 3. Create Groomsmen Portal for party members to join, submit measurements, and track their outfits. 4. Implement Wedding Database Schema with all necessary tables (weddings, party_members, measurements, invitations, etc.). 5. Build comprehensive API endpoints for all wedding functionality. 6. Integrate with existing order management system for seamless workflow. 7. Add email automation for wedding-specific workflows (invitations, reminders, confirmations). 8. Create measurement system with AI-powered size recommendations. 9. Build outfit coordination system for matching groomsmen outfits. 10. Implement group pricing and payment splitting functionality. 11. Add timeline management and automated reminders. 12. Create wedding analytics and reporting. 13. Build mobile-responsive wedding portals. 14. Integrate with existing Stripe, EasyPost, and SendGrid systems. 15. Test entire wedding workflow end-to-end.",
        "status": "pending",
        "priority": "high"
      }
    }
  }
}