{"extracted_information": "Shopify embarked on its React Native (RN) journey five years ago, making it the future of mobile development to achieve code reusability (write once), talent portability across platforms (iOS, Android, Web), and increased value delivery by avoiding feature parity issues. This transition has been highly successful, leading to significant productivity gains, enhanced team flexibility, non-issue feature parity, and high-performance apps. Shopify maintains a hybrid approach, leveraging native code where it's best suited (e.g., hardware interaction, background jobs, memory-intensive features) and RN for most features. They emphasize the crucial role of native developers for deep platform understanding, optimization, and managing RN updates. Challenges include debugging flakeiness, non-seamless updates, and reliance on third-party libraries, mitigated by automation and dedicated teams. A key evolution has been the development of shared foundations and component libraries to increase leverage and consistency across apps.", "specifications": {"screen_load_time": "<500ms (P75)", "crash_free_sessions": ">99.9%"}, "pricing": {}, "features": [{"name": "Decision to switch to RN (5 years ago)", "details": ["Write it once: Stop building same features twice (iOS & Android).", "Talent portability: Enable devs to work fluently across iOS, Android, and Web.", "Ship more value: Focus on delivering user value instead of chasing feature parity."]}, {"name": "Productivity & Flexibility Gains", "details": ["Step change in productivity from not building features twice.", "Engineers work across web and mobile, enabling teams to do more with same resources.", "Maintaining feature parity between iOS and Android became a non-issue."]}, {"name": "Performance", "details": ["Achieved sub-500ms (P75) screen loads in Shopify app and similar performance in all apps.", "Achieved >99.9% crash-free sessions.", "Native doesn't automatically mean fast, RN doesn't automatically mean slow; good patterns are key."]}, {"name": "Developer Experience", "details": ["Hot reloading: Instant reflection of changes, eliminating compile times and improving developer flow.", "Typescript: Unlocks talent portability, easing web developers into mobile RN work and mobile RN developers into web work."]}, {"name": "Hybrid Architecture & Native Expertise", "details": ["Native devs are crucial for platform layer work, bindings, build/release, distribution, optimization, and managing RN updates.", "100% React Native is an anti-goal: Native is best for cutting-edge features (2D/3D scanning, AI models), memory-limited features (widgets, Apple Watch, App Intents, Siri Shortcuts), and long-running background jobs.", "Thinking 'native AND React Native' to leverage best of both worlds.", "Strong interoperability between RN and native."]}, {"name": "Developer Training & Team Composition", "details": ["Invested in training native mobile developers in React Native through self-serve courses and office hours.", "Supplemented mobile teams with web developers for Javascript, Typescript, and React expertise.", "Key to success: good mix of native and web developers."]}, {"name": "Challenges & Mitigations", "details": ["Debugging: Flakey and complex to configure; anticipating improvements with Meta's rewrite.", "React Native updates: Not seamless, requires significant work; mitigated by rotating dedicated developers.", "Reliance on 3rd party libraries: Adds overhead and supply chain risk; mitigated by automated dependency updates (Dependabot) and automated code scanning."]}, {"name": "Shared Foundations & Scalability", "details": ["Initial phase prioritized speed over consistency.", "From 2023, started extracting common components (Identity, real-time monitoring, performance measurement) into shared libraries.", "Shared foundations unlock leverage, prevent reinvention, spread knowledge, and improve all apps automatically."]}, {"name": "Future Outlook & Contributions", "details": ["Optimistic about RN's future, anticipating easier building of fast apps.", "Committed to adopting RN's New Architecture.", "Active contributions to React Native: code contributions, co-release captains, sponsoring open source (React Native Skia, Reanimated), publishing open source (Flashlist, Restyle, Tophat).", "Restarting React Native Working Group (2025) to identify challenges, prioritize investments, and increase collaboration."]}], "statistics": {"screen_load_time_p75_ms": 500, "crash_free_sessions_percentage": 99.9}, "temporal_info": {"initial_RN_adoption": "Five years ago (approx. 2019, relative to 2024 publish date)", "current_state_evaluation": "5 years after adoption (approx. 2024)", "shared_foundations_start": "By the end of 2023", "ongoing_shared_foundations_work": "Continue in 2025", "RN_working_group_restart": "2025", "publication_date": "Jan 13, 2025"}, "geographical_data": {}, "references": [{"type": "announcement", "url": "https://shopify.engineering/react-native-future-mobile-shopify", "description": "Original announcement of React Native as the future of mobile at Shopify"}, {"type": "performance_article", "url": "https://shopify.engineering/improving-shopify-app-s-performance", "description": "Article on improving Shopify app's performance"}, {"type": "performance_video", "url": "https://www.youtube.com/watch?v=88Y1f6S7CGo", "description": "YouTube video on performance"}, {"type": "performance_video", "url": "https://www.youtube.com/watch?v=bEfTgM6QL1E&ab_channel=InfiniteRed", "description": "YouTube video on performance from Infinite Red"}, {"type": "react_native_docs", "url": "https://reactnative.dev/docs/react-native-devtools", "description": "React Native debugger stack documentation"}, {"type": "react_native_architecture_docs", "url": "https://reactnative.dev/architecture/landing-page", "description": "React Native New Architecture landing page"}, {"type": "github_repo", "url": "https://github.com/dependabot", "description": "Dependabot GitHub repository"}, {"type": "github_repo", "url": "https://github.com/Shopify/react-native-skia", "description": "React Native Skia GitHub repository (Shopify sponsored)"}, {"type": "flashlist_docs", "url": "https://shopify.github.io/flash-list", "description": "Flashlist documentation (Shopify open source project)"}, {"type": "github_repo", "url": "https://github.com/Shopify/restyle", "description": "Restyle GitHub repository (Shopify open source project)"}, {"type": "github_repo", "url": "https://github.com/Shopify/tophat", "description": "Tophat GitHub repository (Shopify open source project)"}, {"type": "contact_form", "url": "https://forms.gle/6aQQcfTKBj4fhyMHA", "description": "Form to express interest in joining React Native Working Group"}, {"type": "social_media", "url": "https://x.com/mustafa01ali", "description": "Mustafa Ali's X (Twitter) profile"}]}